import 'package:facebook_app_events/facebook_app_events.dart';
import 'package:flutter/material.dart';
import 'utils/SizeConfig.dart';
import 'ShayariDetailPage.dart';

class ShayariList extends StatefulWidget {
  @override
  _ShayariListState createState() => _ShayariListState();
}

class _ShayariListState extends State<ShayariList> {
  static final facebookAppEvents = FacebookAppEvents();
  var data = [
    "दिल से जो भी मांगोगे मिलेगा\nये गणेश जी का दरबार है,\nदेवों के देव वक्रतुंडा महाकाया को\nअपने हर भक्त से प्यार है..।।\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "गणेश जी का रूप निराला हैं\nचेहरा भी कितना भोला भाला हैं\nजिसे भी आती हैं कोई मुसीबत\nउसे इन्ही ने तोह संभाला हैं\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "चलो खुशियो का जाम हो जाए\nलेके बप्पा का नाम कुछ अच्छा काम हो जाए\nखुशिया बाँट के हर जगह\nआज का दिन बप्पा के नाम हो जाए\nहैप्पी गणेश चतुर्थी",
    "गणेश की ज्योति से नूर मिलता हैं\nसबके दिलो को सुरूर मिलता हैं\nजो भी जाता हैं गणेश के द्वार\nकुछ न कुछ उन्हें जरूर मिलता हैं\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "सब शुभ कारज में पहले पूजा तेरी,\nतुम बिना काम ना सरे, अरज सुन मेरी।\nरिध सिध को लेकर करो भवन में फेरी\nकरो ऐसी कृपा नित करूँ मैं पूजा तेरी।\nगणेश चतुर्थी की शुभ कामनाएं!",
    "आते बड़े धूम धाम से गणपति जी,\nजाते बड़े धूम धाम से गणपति जी,\nआखिर सबसे पहले आकर,\nहमारे दिलो में बस जाते गणपति जी\nगणपति बाबा मोरिया, मंगल मूर्ति मोरया\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "रूप बड़ा निराला\nगणपति मेरा बड़ा प्यार\nजब कभी भी कोई आई मुसीबत\nमेरे बप्पा ने पल में हाल कर डाला\nहैप्पी गणेश चतुर्थी",
    "गणेश जी की ज्योति से नूर मिलता है\nसबके दिलों को सुरूर मिलता है\nजो भी जाता है गणेश जी के द्वार\nकुछ ना कुछ जरूर मिलता है\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "भगवान श्री गणेश की कृपा, बनी रहे आप हर दम\nहर कार्य में सफलता मिले, जीवन में न आये कोई गम\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "एक, दो ,तीन ,चार\nगणपति की जय जयकार\nपाँच, छः, सात, आठ\nगणपति है सबके साथ\nहैप्पी गणेश चतुर्थी",
    "नए कार्य की शुरूआत अच्छी हो\nहर मनोकामना सच्ची हो\nगणेश जी का मन में वास रहे\nइस गणेश चतुर्थी आप अपने के पास रहे\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "खुशियो की सौगात आए\nगणेश जी आपके पास आए\nआपके जीवन मे आए सुख संपाति की बाहर\nगणेश जी अपने साथ लाए धन सम्पति अपार\nगणेश चतुर्थी की हार्दिक शुभकामनाये",
    "सुख मिले समृद्धि मिले\nमिले खुशी अपार\nआपका जीवन सफल हो\nजब आए गणेश जी आपके द्वार\nहैप्पी गणेश चतुर्थी",
    "रिद्धि-सिद्धि के तुम हो दाता\nदीन दुखियों के भाग्य विधाता\nतुझमें ज्ञान-सागर अपार\nप्रभु कर दे मेरी नैया पार\nहैप्पी गणेश चतुर्थी",
    "सुख-सम्पति मिले\nमिले ख़ुशी-शांति अपार\nआपका जीना सफ़ल हो\nजब आप आएँ गणेश जी के द्वार\nहैप्पी गणेश चतुर्थी",
    "आते बड़े धूम से गणपति जी\nजाते बड़े धूम से गणपति जी\nआख़िर सबसे पहले आकर\nहमारे दिलों मे बस जाते गणपति जी\nहैप्पी गणेश चतुर्थी",
    "धरती पर बारिश की बुँदे बरसे\nआपके ऊपर अपनों का प्यार बरसे\nगणेश जी से बस यही दुआ है\nआप ख़ुशी के लिए नहीं ख़ुशी आपके लिए तरसे\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "दिल से जो भी मांगोगे मिलेगा\nये गणेश जी का दरबार है\nदेवों के देव वक्रतुंड महाकाय को\nअपने हर भक्त से प्यार है\nगणेश चतुर्थी की हार्दिक शुभकामनाये",
    "गणेश जी आपको नूर दे\nखुशियाँ आपको संपूर्ण दे\nआप जाए गणेश जी के दर्शन को\nऔर गणेश जी आपको सुख संपति भरपूर दे\nहैप्पी गणेश चतुर्थी",
    "पल पल से बनता है एहसास\nएहसास से बनता है विश्वास\nविश्वास से बनते है रिश्ते\nऔर रिश्तों से बनता है कोई खास\nमुबारक हो ये गणेश चतुर्थी झकास",
    "ज़मीन पर आकाश झूम के बरसे\nआपके ऊपर अपनों का प्यार बरसे\nभगवान गणेश जी से बस यही प्रार्थना हैं\nआप ख़ुशी के लिए नही, ख़ुशी आप के लिए तरसे\nगणेश चतुर्थी की हार्दिक शुभकामनायें",
    "अँधेरा हुआ दूर रात के साथ\nनयी सुबह आयी बधाई के साथ\nअब आँखें खोलो देखो एक मैसेज आया है\nगणेश चतुर्थी की शुभकामनायें लाया है",
    "गणेश जी का रूप निराला है\nचेहरा भी कितना भोला भाला है\nजिसे भी आती है कोई मुसीबत\nउसे इन्ही ने तो संभाला है",
    "आपका और खुशियो का जन्म-जन्म का साथ हो\nआप की तरक्की की हर किसी की ज़ुबान पर बात हो\nजब भी कोई मुश्किल आए, गणेश जी हमेशा आप के साथ हो\nगणेश चतुर्थी की हार्दिक शुभकामनाये",
    "भक्ति गणपति। शक्ति गणपति।\nसिद्दी गणपति, लक्ष्मी गणपति\nमहा गणपति, देवो में श्रेष्ठ मेरे गणपति\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "कर दो हमारे जीवन से दुःख दर्दो का नाश\nचिंतामन कर दो कृपा पूरण सबके काज..।।\nगणेश चतुर्थी की शुभ कामनाएं!",
    "गणेश जी का रूप निराला हैं\nचेहरा देखो कितना भोला भाला हैं\nजब भी हम पर आए कोई मुसीबत\nगणेश जी ने ही तो हमे संभाला हैं!\nहैप्पी गणेश चतुर्थी",
    "सब शुभ कारज में पहले पूजा तेरी,\nतुम बिना काम ना सरे, अरज सुन मेरी\nरिध सिध को लेकर करो भवन में फेरी\nकरो ऐसी कृपा नित करूँ मैं पूजा तेरी..\nगणेश चतुर्थी की शुभ कामनाएं!",
    "भगवान श्री गणेश की कृपा,\nबनी रहे आप हर दम।\nहर कार्य में सफलता मिले,\nजीवन में न आये कोई गम।",
    "आपका और खुशियों का,\nजनम जनम का साथ हो।।",
    "“वक्रतुण्ड महाकाय सुर्यकोटि समप्रभ\nनिर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा”",
    "दिल से जो भी मांगोगे मिलेगा\nये गणेश जी का दरबार है,\nदेवों के देव वक्रतुंडा महाकाया को\nअपने हर भक्त से प्यार है..!!\nगणेश चतुर्थी की शुभ कामनाएं!",
    "गणपति जी का सर पर हाथ हो; हमेशा उनका साथ हो;\nखुशियों का हो बसेरा; करे शुरुआत बप्पा के गुणवान से मंगल फिर हर काम हो!\nगणेश चतुर्थी की शुभकामना",
    "धरती पर बारिश की बुँदे बरसे,\nआप के ऊपर अपनों का प्यार बरसे।\n“गणेशजी” से बस यही दुआ हैं।।\nआप ख़ुशी के लिए नहीं,\nख़ुशी आप के लिए तरसे।।",
    "भक्ति गणपति। शक्ति गणपति।\nसिद्दी गणपति, लक्ष्मी गणपति\nमहा गणपति, देवो में श्रेष्ठ मेरे गणपति\nहैप्पी गणेश चतुर्थी",
    "गणेश की ज्योति से नूर मिलता हैं\nसबके दिलो को सुरूर मिलता हैं\nजो भी जाता हैं गणेश के द्वार\nकुछ न कुछ उन्हें जरूर मिलता हैं\nGanpati Bappa Morya ..",
    "“वक्रतुण्ड महाकाय सुर्यकोटि समप्रभ\nनिर्विघ्नं कुरु मे देव सर्वकार्येषु सर्वदा”",
    "पग में फूल खिले। हर ख़ुशी आपको मिले।\nकभी न हो दुखों का सामना। यही मेरी\nगणेश चतुर्थी की शुभकामना।",
    "मेरे लाडले मेरे गणपति प्यारे\nतुम शिव बाबा की आँखों के तारे\nमेरी आँखों में तेरी सूंदर मूरत\nकिरणों जैसे चमके तेरी प्यारी सूरत\nHappy Ganesh Chaturthi",
    "सुखा करता जय मोरया,\nदुख हरता जय मोरया।\nकृपा सिन्धु जय मोरया,\nबुद्धि विधाता मोरया।\nगणपति बप्पा मोरया,\nमंगल मूर्ती मोरया।\nगणेश चतुर्थी की शुभ कामनाएं",
    "सुख करता जय मोरया\nदुःख हरता जय मोरया\nकृपा सिन्धु जय मोरया\nबुद्धि विधाता जय मोरया\nगणपति बप्पा मोरया\nमंगल मूर्ती मोरया\nहैप्पी गणेश चतुर्थी",
    "गुल ने गुलशन से गुलफाम भेजा है\nसितारों ने गगन से सलाम भेजा है\nमुबारक हो आपको ये गणेश चतुर्थी\nहमने तहे दिल से ये पैगाम भेजा है\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "गणेश जी का रूप निराला है\nचेहरा भी कितना भोला-भाला है\nजिसे भी आती है कोई मुसीबत\nउसे इन्ही ने तो संभाला है\nहैप्पी गणेश चतुर्थी",
    "मेरे लाडले मेरे गणपति प्यारे\nतुम शिव बाबा की आँखों के तारे\nमेरी आँखों में तेरी सूंदर मूरत\nकिरणों जैसे चमके तेरी प्यारी सूरत\nगणेश चतुर्थी की हार्दिक शुभकामनाएं",
    "आते बड़े धूम धाम से गणपति जी,\nजाते बड़े धूम धाम से गणपति जी,\nआखिर सबसे पहले आकर,\nहमारे दिलो में बस जाते गणपति जी",
    "गणेश जी की ज्योति से नूर मिलता हैं,\nसबके दिलों को सुरूर मिलता हैं,\nजो भी जाता है गणेश जी के द्वार,\nउसे कुछ ना कुछ ज़रूर मिलता हैं\nGanpati Bappa Morya",
    "आपका सुख गणेश के पेट जितना बड़ा हो\nआपका दुःख उंदर जैसा छोटा हो,\nआपकी लाइफ गणेश जी की सूंड जितनी बड़ी हो\nआपके बोल मोदक जैसे मीठे हो",
    "आज से “GM” मतलब “Ganpati Bappa Morya”\nऔर “GN” मतलब “Ganeshayah Namah”",
    "एक दो तीन चार.. गणपति की जय जय कार\nपांच छे सात हाथ.. गणपति है सबके साथ।।",
    "गणपति बाप्पा आये हैं साथ खुशहाली लाये हैं\nगणेश जी के आशीर्वाद से ही हमने सुख के गीत गाये हैं।",
    "गणेश चतुर्थी के पवन पर्व पर विघ्नहर्ता को आओ सब करे नमन\nहर कोई हो स्नेह से बंधा, मन की भक्ति कर दे अर्पण…।।।।।।",
    "अँधेरा हुआ दूर रात के साथ,\nनयी सुबह आयी बधाई लेके साथ,\nअब आंख्ने खोलो और देखो एक मैसेज आया हैं\nगणेश चतुर्थी की शुभकामना साथ लाया हैं",
    "*****\nधरती पर बारिश की बुँदे बरसे\nआप के ऊपर अपनों का प्यार बरसे\n“गणेशजी” से बस यही दुआ हैं\nआप ख़ुशी के लिए नहीं\nख़ुशी आप के लिए तरसे\nहैप्पी गणेश चतुर्थी",
    "दिल से जो भी मांगोगे मिलेगा\nये गणेश जी का दरबार है\nदेवों के देव वक्रतुंडा महाकाया को\nअपने हर भक्त से प्यार है\nहैप्पी गणेश चतुर्थी",
    "*****\nहर शुभ कार्य में पहले पूजा तेरी\nतुम बिना काम ना सरे अरज सुन मेरी\nरिध सिध को लेकर करो भवन में फेरी\nकरो ऐसी कृपा नित करूँ मैं पूजा तेरी\nगणेश चतुर्थी की हार्दिक शुभकामनाएं"
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(
          "Shayari List",
          style: Theme.of(context).appBarTheme.textTheme.headline1,
        ),
      ),
      body: SafeArea(
        child: data != null
            ? ListView.builder(
                itemBuilder: (context, index) {
                  return GestureDetector(
                    child: Padding(
                      padding:
                          EdgeInsets.all(1.93 * SizeConfig.widthMultiplier),
                      child: Column(
                        children: <Widget>[
                          Container(
                            decoration: BoxDecoration(
                                border: Border.all(
                                  color: Theme.of(context)
                                      .colorScheme
                                      .primaryVariant,
                                ),
                                borderRadius:
                                    // 40 / 8.96 = 4.46
                                    BorderRadius.all(Radius.circular(
                                        4.46 * SizeConfig.widthMultiplier))),
                            child: ListTile(
                              leading: Icon(
                                Icons.brightness_1,
                                color: Theme.of(context).primaryIconTheme.color,
                              ),
                              title: Text(
                                data[index],
                                maxLines: 2,
                                style: Theme.of(context).textTheme.bodyText1,
                              ),
                              trailing: Icon(Icons.arrow_forward_ios,
                                  color:
                                      Theme.of(context).primaryIconTheme.color),
                            ),
                          ),
                        ],
                      ),
                    ),
                    onTap: () {
                      Navigator.push(
                          context,
                          new MaterialPageRoute(
                              builder: (context) =>
                                  ShayariDetailPage(data[index], index)));

                      facebookAppEvents.logEvent(
                        name: "Shayari List",
                        parameters: {
                          'clicked_on_shayari_index': '$index',
                        },
                      );
                    },
                  );
                },
                itemCount: data.length,
              )
            : Center(
                child: CircularProgressIndicator(),
              ),
      ),
    );
  }
}
